const BACK_MENU = {
  reply_markup: {
    keyboard: [["⬅️ Назад"], ["Головне меню"]],
    resize_keyboard: true,
  },
};

function register(bot) {
  bot.on("message", (msg) => {
    if (!msg.text) return;
    if (msg.text === "🎁 Акції") {
      bot.sendMessage(
        msg.chat.id,
        'Поточні акції 🎁\n\n1. Глінтвейн за відмітку в сторіз 🍹\nВідпочивай у нас, відмічай це в сторіз у інстаграмі та показуй відмітку офіціанту — отримуй глінтвейн безкоштовно.\n\n2. Десерт в честь дня народження ❤️\nДеталі:\nПриходь у Felis 👉🏻 показуй свої документи 👉🏻 святкуй 🌿\n\n3. ФІРМОВА ПАЛЯНИЧКА ЗА ВІДГУК 🥗\nПиши у пошуку "Google" Ресторан Felis та залишай свій відгук на нашій сторінці, а потім приходь за своєю безкоштовною паляничкою.',
        BACK_MENU
      );
    }
  });
}

module.exports = { register };
